; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v12 ?v6)
             (pred_3 ?v5 ?v11)
             (pred_8 ?v12 ?v11)
             (pred_5 ?v8 ?v12 )
	     (pred_12 ?v12)
             (pred_1 ?v9)
             (pred_7 ?v5)
             (pred_4 ?v11)
             (pred_10 ?v12)
             (pred_2 ?v5)
             (pred_6 ?v12)
             (pred_11 ))



(:action op_5
:parameters (?v10 ?v7 ?v2 ?v4)
:precondition (and (pred_1 ?v10) (pred_1 ?v7) (pred_7 ?v2) (pred_4 ?v4)
          (pred_9 ?v10 ?v7) (pred_3 ?v2 ?v4)
                   (pred_8 ?v7 ?v4) (pred_12 ?v10) 
                   (pred_10 ?v7) (pred_2 ?v2))
:effect (and  (pred_6 ?v7) (not (pred_10 ?v7))))


(:action op_3
:parameters (?v10 ?v13)
:precondition (and (pred_1 ?v10) (pred_1 ?v13)
               (pred_12 ?v10) (pred_9 ?v10 ?v13) (pred_6 ?v13))
:effect (and (pred_12 ?v13) (not (pred_12 ?v10))))

(:action op_2
:parameters (?v10 ?v2)
:precondition (and (pred_1 ?v10) (pred_7 ?v2) 
                  (pred_12 ?v10) (pred_5 ?v2 ?v10) (pred_11 ))
:effect (and (pred_2 ?v2)
   (not (pred_5 ?v2 ?v10)) (not (pred_11 ))))


(:action op_4
:parameters (?v10 ?v1 ?v3)
:precondition (and (pred_1 ?v10) (pred_7 ?v1) (pred_7 ?v3)
                  (pred_12 ?v10) (pred_2 ?v3) (pred_5 ?v1 ?v10))
:effect (and (pred_2 ?v1) (pred_5 ?v3 ?v10)
        (not (pred_2 ?v3)) (not (pred_5 ?v1 ?v10))))

(:action op_1
:parameters (?v10 ?v2)
:precondition (and (pred_1 ?v10) (pred_7 ?v2) 
                  (pred_12 ?v10) (pred_2 ?v2))
:effect (and (pred_11 ) (pred_5 ?v2 ?v10) (not (pred_2 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_24 obj_31 obj_17 obj_19 obj_01 obj_30 obj_20 obj_08 obj_27 obj_03 obj_21 obj_29 obj_28 obj_25 obj_07 obj_06 obj_10 obj_14 obj_12 obj_18 obj_23 obj_05 obj_11 obj_16
    obj_22 obj_13 obj_09
    obj_26 obj_02 obj_04
    )

    (:init
       (pred_11)

       (pred_1 obj_15)
       (pred_1 obj_24)
       (pred_1 obj_31)
       (pred_1 obj_17)
       (pred_1 obj_19)
       (pred_1 obj_01)
       (pred_1 obj_30)
       (pred_1 obj_20)
       (pred_1 obj_08)
       (pred_1 obj_27)
       (pred_1 obj_03)
       (pred_1 obj_21)
       (pred_1 obj_29)
       (pred_1 obj_28)
       (pred_1 obj_25)
       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_10)
       (pred_1 obj_14)
       (pred_1 obj_12)
       (pred_1 obj_18)
       (pred_1 obj_23)
       (pred_1 obj_05)
       (pred_1 obj_11)
       (pred_1 obj_16)
       (pred_4 obj_22)
       (pred_4 obj_13)
       (pred_4 obj_09)
       (pred_7 obj_26)
       (pred_7 obj_02)
       (pred_7 obj_04)

       (pred_9 obj_15 obj_01)
       (pred_9 obj_15 obj_24)
       (pred_9 obj_24 obj_30)
       (pred_9 obj_24 obj_31)
       (pred_9 obj_24 obj_15)
       (pred_9 obj_31 obj_20)
       (pred_9 obj_31 obj_17)
       (pred_9 obj_31 obj_24)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_17 obj_19)
       (pred_9 obj_17 obj_31)
       (pred_9 obj_19 obj_27)
       (pred_9 obj_19 obj_17)
       (pred_9 obj_01 obj_03)
       (pred_9 obj_01 obj_30)
       (pred_9 obj_01 obj_15)
       (pred_9 obj_30 obj_21)
       (pred_9 obj_30 obj_20)
       (pred_9 obj_30 obj_24)
       (pred_9 obj_30 obj_01)
       (pred_9 obj_20 obj_29)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_20 obj_31)
       (pred_9 obj_20 obj_30)
       (pred_9 obj_08 obj_28)
       (pred_9 obj_08 obj_27)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_27 obj_25)
       (pred_9 obj_27 obj_19)
       (pred_9 obj_27 obj_08)
       (pred_9 obj_03 obj_07)
       (pred_9 obj_03 obj_21)
       (pred_9 obj_03 obj_01)
       (pred_9 obj_21 obj_06)
       (pred_9 obj_21 obj_29)
       (pred_9 obj_21 obj_30)
       (pred_9 obj_21 obj_03)
       (pred_9 obj_29 obj_10)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_29 obj_20)
       (pred_9 obj_29 obj_21)
       (pred_9 obj_28 obj_14)
       (pred_9 obj_28 obj_25)
       (pred_9 obj_28 obj_08)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_25 obj_12)
       (pred_9 obj_25 obj_27)
       (pred_9 obj_25 obj_28)
       (pred_9 obj_07 obj_18)
       (pred_9 obj_07 obj_06)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_06 obj_23)
       (pred_9 obj_06 obj_10)
       (pred_9 obj_06 obj_21)
       (pred_9 obj_06 obj_07)
       (pred_9 obj_10 obj_05)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_10 obj_29)
       (pred_9 obj_10 obj_06)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_14 obj_12)
       (pred_9 obj_14 obj_28)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_12 obj_16)
       (pred_9 obj_12 obj_25)
       (pred_9 obj_12 obj_14)
       (pred_9 obj_18 obj_23)
       (pred_9 obj_18 obj_07)
       (pred_9 obj_23 obj_05)
       (pred_9 obj_23 obj_06)
       (pred_9 obj_23 obj_18)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_10)
       (pred_9 obj_05 obj_23)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_16 obj_12)
       (pred_9 obj_16 obj_11)
       (pred_10 obj_28)
       (pred_10 obj_05)
       (pred_10 obj_18)
       (pred_8  obj_28 obj_22)
       (pred_8  obj_05 obj_13)
       (pred_8  obj_18 obj_09)
       (pred_6 obj_15)
       (pred_6 obj_24)
       (pred_6 obj_31)
       (pred_6 obj_17)
       (pred_6 obj_19)
       (pred_6 obj_01)
       (pred_6 obj_30)
       (pred_6 obj_20)
       (pred_6 obj_08)
       (pred_6 obj_27)
       (pred_6 obj_03)
       (pred_6 obj_21)
       (pred_6 obj_29)
       (pred_6 obj_25)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_10)
       (pred_6 obj_14)
       (pred_6 obj_12)
       (pred_6 obj_23)
       (pred_6 obj_11)
       (pred_6 obj_16)

       (pred_3  obj_26 obj_22)
       (pred_3  obj_02 obj_13)
       (pred_3  obj_04 obj_09)
       (pred_5 obj_26 obj_24)
       (pred_5 obj_02 obj_10)
       (pred_5 obj_04 obj_12)
       (pred_12 obj_07)
    )

    (:goal (and
       (pred_5 obj_26 obj_28)
       (pred_5 obj_04 obj_27)
    ))
(:constraints
  (always (not (pred_12 obj_08)))
)
)

; plan
1. (op_3 obj_07 obj_06)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_06)
   goals met: 0 of 2
2. (op_3 obj_06 obj_10)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_10)
   goals met: 0 of 2
3. (op_3 obj_10 obj_14)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_14)
   goals met: 0 of 2
4. (op_3 obj_14 obj_12)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_12)
   goals met: 0 of 2
5. (op_2 obj_12 obj_04)
   deleted: (pred_5 obj_04 obj_12) (pred_11)
   added: (pred_2 obj_04)
   goals met: 0 of 2
6. (op_3 obj_12 obj_25)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_25)
   goals met: 0 of 2
7. (op_3 obj_25 obj_27)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_27)
   goals met: 0 of 2
8. (op_1 obj_27 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_11) (pred_5 obj_04 obj_27)
   goals met: 1 of 2
9. (op_3 obj_27 obj_19)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_19)
   goals met: 1 of 2
10. (op_3 obj_19 obj_17)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_17)
   goals met: 1 of 2
11. (op_3 obj_17 obj_31)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_31)
   goals met: 1 of 2
12. (op_3 obj_31 obj_24)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_24)
   goals met: 1 of 2
13. (op_2 obj_24 obj_26)
   deleted: (pred_5 obj_26 obj_24) (pred_11)
   added: (pred_2 obj_26)
   goals met: 1 of 2
14. (op_3 obj_24 obj_31)
   deleted: (pred_12 obj_24)
   added: (pred_12 obj_31)
   goals met: 1 of 2
15. (op_3 obj_31 obj_20)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_20)
   goals met: 1 of 2
16. (op_3 obj_20 obj_29)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_29)
   goals met: 1 of 2
17. (op_5 obj_29 obj_28 obj_26 obj_22)
   deleted: (pred_10 obj_28)
   added: (pred_6 obj_28)
   goals met: 1 of 2
18. (op_3 obj_29 obj_28)
   deleted: (pred_12 obj_29)
   added: (pred_12 obj_28)
   goals met: 1 of 2
19. (op_1 obj_28 obj_26)
   deleted: (pred_2 obj_26)
   added: (pred_11) (pred_5 obj_26 obj_28)
   goals met: 2 of 2
